Revit 2024 API
RebarContainer.PresentItemsAsSubelements Property
 Identifies if Items should be presented in schedules and tags as separate subelements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public bool PresentItemsAsSubelements { get; set; }
Visual Basic
Public Property PresentItemsAsSubelements As Boolean
	Get
	Set
Visual C++
public:
property bool PresentItemsAsSubelements {
	bool get ();
	void set (bool value);
}
See Also
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace